Revit 2026 API

# SphericalLightDistribution Properties

---

The SphericalLightDistribution type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from LightDistribution) |

#### Reference

SphericalLightDistribution Class

Autodesk.Revit.DB.Lighting Namespace